{"meta":{"title":"何相昆","subtitle":"","description":"","author":"hexiangkun","url":"http://example.com","root":"/"},"pages":[{"title":"404 Not Found：该页无法显示","date":"2022-09-17T02:39:49.988Z","updated":"2022-09-17T02:39:49.988Z","comments":false,"path":"/404.html","permalink":"http://example.com/404.html","excerpt":"","text":""},{"title":"书单","date":"2022-09-17T02:39:49.990Z","updated":"2022-09-17T02:39:49.990Z","comments":false,"path":"books/index.html","permalink":"http://example.com/books/index.html","excerpt":"","text":""},{"title":"友情链接","date":"2022-09-17T02:39:49.990Z","updated":"2022-09-17T02:39:49.990Z","comments":true,"path":"links/index.html","permalink":"http://example.com/links/index.html","excerpt":"","text":""},{"title":"关于","date":"2022-09-17T02:39:49.989Z","updated":"2022-09-17T02:39:49.989Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"个人详细介绍"},{"title":"Repositories","date":"2022-09-17T02:39:49.990Z","updated":"2022-09-17T02:39:49.990Z","comments":false,"path":"repository/index.html","permalink":"http://example.com/repository/index.html","excerpt":"","text":""},{"title":"分类","date":"2022-09-17T02:39:49.990Z","updated":"2022-09-17T02:39:49.990Z","comments":false,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2022-09-17T02:39:49.992Z","updated":"2022-09-17T02:39:49.992Z","comments":false,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Daliy_Calorie","slug":"Daliy-Calorie","date":"2022-09-18T02:58:12.000Z","updated":"2022-09-20T10:24:10.456Z","comments":true,"path":"2022/09/18/Daliy-Calorie/","link":"","permalink":"http://example.com/2022/09/18/Daliy-Calorie/","excerpt":"","text":"Document /* 标签选择器 */ h2 { font-family: \"微软雅黑\"; } p { font-family: \"楷体\"; font-size:20px; } b { font-family: \"楷体\"; font-size:20px; } li{ font-family: \"楷体\"; font-size:20px; } Daliy Calorie App 1. Background After the third scientific and technological revolution, the quality of life of modern people has improved rapidly, famine has left us, and few people are hungry. After the third scientific and technological revolution, the quality of life of modern people has improved rapidly, famine has left us, and few people are hungry. 1. Global graph of the number of obese women in 1975-20161 2. Global male obesity graph from 1975-20162 In recent years, more and more people have a strong demand for healthy living and body management, so we hope to make such an app to control people's calorie and nutrient intake, and provide corresponding diet plans and Athletic training program. 2. Application function (1). Calculate the daily calorie profit and loss and daily nutrient intake. (2). Control the user's weight. (3). Provide nutrition and training programs. (4). Help users achieve a healthy life. 3. Calculation formula (1). daily food calorie intake - basal metabolism - exercise consumption = daily calorie gain and loss (2). The daily food calorie and nutrient intake are captured by the in-app camera, and the category and weight of the food are identified by artificial intelligence. (3). The calculation formula of rough measurement of basal metabolic rate is : Female basal metabolic rate=661+9.6×weight (kg)+1.72×height (cm)-4.7×age Male basal metabolic rate=67+13.73×weight (kg)+5×height (cm)-6.9×age (4). Exercise consumption is calculated by the smart bracelet. 4. Target users Our target demographic is more inclined to young people.Humans who have requirements for weight control and healthy living, or fitness people who need to gain muscle or lose fat. 3. Age distribution of fitness people3 5. Team division of labor 5 for demand, 10 for design, 10 for development, 5 for testing, 5 for project, 5 for operation and maintenance, and 3 for overall management. 6. Design tasks and solutions to corresponding problems Calculate the daily food calorie and nutrient intake. Authorize the camera, put food on a custom-sized plate (do not stack food), take a photo, identify the category and weight of things through a pre-trained deep learning network, query the nutrients and calories per unit mass of food in the database, and calculate Calorie intake and nutrients. Calculate the basal metabolism of the human body. Due to the difference of each person's constitution and hormones, it is difficult to accurately measure the basal metabolic rate. We use the calculation formula of the basal metabolic rate: Female basal metabolic rate=661+9.6×weight (kg)+1.72×height (cm)-4.7×age Male basal metabolic rate=67+13.73×weight (kg)+5×height (cm)-6.9×age Calculate the exercise consumption. Bring a sports bracelet (such as Xiaomi sports bracelet), bind the sports bracelet to the daily calorie app, and calculate the energy consumed by the daily walking steps and the exercise time of the corresponding exercise (the Xiaomi sports bracelet has been implement this function) 4. Fitness crowd smart device wear distribution4 Healthy eating plan. According to the user's eating habits, give a healthy eating plan (can be customized after payment). According to the user's heart rate and exercise habits, remind the user that they should exercise or take a proper rest, and give a training plan in stages (can be customized after payment) Daily popularize. Daily popularize the nutritional content of healthy food, and call on users to consume more organic food to improve users' dietary sensitivity. 参考链接： NCD-RisC NCD-RisC MobTech 每日互动","categories":[],"tags":[{"name":"HCI","slug":"HCI","permalink":"http://example.com/tags/HCI/"}]},{"title":"Hello World","slug":"hello-world","date":"2022-09-11T10:39:21.309Z","updated":"2022-09-11T10:39:21.309Z","comments":true,"path":"2022/09/11/hello-world/","link":"","permalink":"http://example.com/2022/09/11/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"HCI","slug":"HCI","permalink":"http://example.com/tags/HCI/"}]}